### ANSWER TO QUESTION 1:

#### List any five functions of the pandas library with execution.

In [37]:
#FUNCTION 1 - LEN()
import pandas as pd
df=pd.DataFrame({'SNO':[1,2,3,4,5],'NAME':['AAA','BBB','CCC','DDD','EEE'],'AGE':[18,19,20,20,21]})
len(df)
df

   SNO NAME  AGE
0    1  AAA   18
1    2  BBB   19
2    3  CCC   20
3    4  DDD   20
4    5  EEE   21

In [38]:
#FUNCTION2 -TRANSPOSE()
df.transpose()

        0    1    2    3    4
SNO     1    2    3    4    5
NAME  AAA  BBB  CCC  DDD  EEE
AGE    18   19   20   20   21

In [39]:
#FUNCTION3 - ILOC()
df.iloc[0:2]

   SNO NAME  AGE
0    1  AAA   18
1    2  BBB   19

In [41]:
#function4-loc()
df.loc[0:2,['AGE']]

   AGE
0   18
1   19
2   20

In [13]:
#FUNCTION5-drop()
df2=pd.DataFrame({'SNO':[6,7,8,9,10],'NAME':['FFF','GGG','HHH','III','JJJ'],'AGE':[22,23,24,24,25]})
df2

   SNO NAME  AGE
0    6  FFF   22
1    7  GGG   23
2    8  HHH   24
3    9  III   24
4   10  JJJ   25

In [14]:
df2.drop('AGE',axis=1)

   SNO NAME
0    6  FFF
1    7  GGG
2    8  HHH
3    9  III
4   10  JJJ

### ANSWER TO QUESTION 2:

#### Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the 
#### DataFrame with a new index that starts from 1 and increments by 2 for each row

In [19]:
df=pd.DataFrame({'A':[1,2,3],'B':[4,5,6],'C':[7,8,9]})

In [20]:
df

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [24]:
df1=(range(1, 2*len(df)+1, 2))
df.index=df1

In [25]:
df

   A  B  C
1  1  4  7
3  2  5  8
5  3  6  9

### ANSWER TO QUESTION 3:

##### You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that 
##### iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The 
##### function should print the sum to the console.
#####  For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should 
##### calculate and print the sum of the first three values, which is 60.

In [57]:
def question3(df):
    df1=df.loc[0:2,['values']].sum()
    return df1
import pandas as pd
df=pd.DataFrame({'SNO':[1,2,3,4,5],'NAME':['FFF','GGG','HHH','III','JJJ'],'values':[10,20,30,40,50]})
question3(df)

values    60
dtype: int64

### ANSWER TO QUESTION 4:

#### Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 
#### 'Word_Count' that contains the number of words in each row of the 'Text' column.

In [64]:
df=pd.DataFrame({'SNO':[1,2,3,4,5],'TEXT':['hello i am','kamesh from','trichy tamilnadu','welcome to','our state']})
def add_word_count_column(df):
    df['Word_Count'] = df['TEXT'].apply(lambda x: len(x.split()))
    return df

# Example usage
df = add_word_count_column(df)
print(df)

   SNO              TEXT  Word_Count
0    1        hello i am           3
1    2       kamesh from           2
2    3  trichy tamilnadu           2
3    4        welcome to           2
4    5         our state           2

### ANSWER TIO QUESTION 5:

####  How are DataFrame.size() and DataFrame.shape() different?

##### DataFrame.size returns the total number of elements in the DataFrame, which is the product of the number of rows and columns. It's essentially the total count of data points in the DataFrame.

##### DataFrame.shape, on the other hand, returns a tuple representing the dimensionality of the DataFrame, which includes the number of rows (first element) and the number of columns (second element).

### ANSWER TO QUESTION 6:

#### Which function of pandas do we use to read an excel file?

##### read_csv() is used to read the excel files from pandas and it is to be noted that the pandas reads the first sheet of excel by default.

### ANSWER TO QUESTION 7:

#### You have a Pandas DataFrame df that contains a column named 'Email' that contains email 
#### addresses in the format 'username@domain.com'. Write a Python function that creates a new column 
#### 'Username' in df that contains only the username part of each email address.
#### The username is the part of the email address that appears before the '@' symbol. For example, if the 
#### email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your 
#### function should extract the username from each email address and store it in the new 'Username' 
#### column

In [74]:
def retriveusername(df):
    df['username']=df['EMAIL'].apply(lambda x: x.split('@')[0])
    return df
import pandas as pd
df=pd.DataFrame({'SNO':[1,2,3,4,5],'NAME':['AAA','BBB','CCC','DDD','EEE'],'EMAIL':['abinesh@gmail.com','venkatesh.p@gmail.com','kamesh.s@gmail.com','mohammed@gmail.com','danieldavid@gmail.com']})
retriveusername(df)

   SNO NAME                  EMAIL     username
0    1  AAA      abinesh@gmail.com      abinesh
1    2  BBB  venkatesh.p@gmail.com  venkatesh.p
2    3  CCC     kamesh.s@gmail.com     kamesh.s
3    4  DDD     mohammed@gmail.com     mohammed
4    5  EEE  danieldavid@gmail.com  danieldavid

### ANSWER TO QUESTION 8:

#### You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects 
#### all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The 
#### function should return a new DataFrame that contains only the selected rows.
#### For example, if df contains the following values:
#### A   B   C
# 0  3   5   1
# 1  8   2   7
# 2  6   9   4
# 3  2   3   5
# 4  9   1   2
#### Your function should select the following rows:   
#### A   B   C#
 1  8   2   7#
 4  9   1   ####2
 The function should return a new DataFrame that contains only the selected rows.

In [1]:
import pandas as pd
df=pd.DataFrame({'A':[3,8,6,2,9],'B':[5,2,9,3,1],'C':[1,7,4,5,2]})
df

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [5]:
import pandas as pd
df=pd.DataFrame({'A':[3,8,6,2,9],'B':[5,2,9,3,1],'C':[1,7,4,5,2]})
def function01(df):
    df1=df[(df['A']>5) & (df['B']<10)]
    return df1
function01(df)

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

### ANSWER TO QUESTION 9:

#### Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean, 
#### median, and standard deviation of the values in the 'Values' column

In [6]:
import pandas as pd
df=pd.DataFrame({'name':["AAA","BBB","CCC","DDD","EEE"],'values':[100,200,300,400,500]})
me=df['values'].mean()
med=df['values'].median()
st=df['values'].std()
print("The Mean is:",me,"\nThe Median is:",med,"\nThe Standard Deviation is:",st)

The Mean is: 300.0
The Median is: 300.0
The Standard Deviation is: 158.11388300841898

### ANSWER TO QUESTION 10:

#### Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to 
#### create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days 
#### for each row in the DataFrame. The moving average should be calculated using a window of size 7 and 
#### should include the current day.

In [8]:
import pandas as pd
df=pd.DataFrame({'Sales':[1000,2000,1500,700,4000,6500,3000],'Date':['2024-07-15','2024-07-16','2024-07-17','2024-07-18','2024-07-19','2024-07-20','2024-07-21']})
df

   Sales        Date
0   1000  2024-07-15
1   2000  2024-07-16
2   1500  2024-07-17
3    700  2024-07-18
4   4000  2024-07-19
5   6500  2024-07-20
6   3000  2024-07-21

In [15]:
def question10(df):
    df['Date'] = pd.to_datetime(df['Date'])
    df['MovingAverage']=df['Sales'].rolling(window=7,min_periods=1).mean()
    df['Day']=df['Date'].dt.day
    return df
import pandas as pd
df=pd.DataFrame({'Sales':[1000,2000,1500,700,4000,6500,3000],'Date':['2024-07-15','2024-07-16','2024-07-17','2024-07-18','2024-07-19','2024-07-20','2024-07-21']})
question10(df)

   Sales       Date  MovingAverage  Day
0   1000 2024-07-15    1000.000000   15
1   2000 2024-07-16    1500.000000   16
2   1500 2024-07-17    1500.000000   17
3    700 2024-07-18    1300.000000   18
4   4000 2024-07-19    1840.000000   19
5   6500 2024-07-20    2616.666667   20
6   3000 2024-07-21    2671.428571   21

### ASNWER TO QUESTION 11:

#### You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new 
#### column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g. 
#### Monday, Tuesday) corresponding to each date in the 'Date' column.

In [18]:
import pandas as pd
df=pd.DataFrame({'Date':['2024-07-15','2024-07-16','2024-07-17','2024-07-18','2024-07-19','2024-07-20','2024-07-21']})

def question11(df):
    df['Date']=pd.to_datetime(df['Date'])
    df['Day']=df['Date'].dt.day_name()
    return df
question11(df)

        Date        Day
0 2024-07-15     Monday
1 2024-07-16    Tuesday
2 2024-07-17  Wednesday
3 2024-07-18   Thursday
4 2024-07-19     Friday
5 2024-07-20   Saturday
6 2024-07-21     Sunday

### ANSWER TO QUESTION 12:

#### Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python 
#### function to select all rows where the date is between '2023-01-01' and '2023-01-31'

In [19]:
import pandas as pd
df = pd.DataFrame({
    'Date': [
        '2023-01-05 10:00:00', '2023-01-15 12:30:00', '2023-02-01 09:00:00', 
        '2023-01-25 14:00:00', '2022-12-31 23:59:59'
    ],
    'Sales': [1000, 1500, 2000, 2500, 3000]})
def question12(df):
    df_new=df[df['Date'].between('2023-01-01','2023-01-31')]
    return df_new
question12(df)

                  Date  Sales
0  2023-01-05 10:00:00   1000
1  2023-01-15 12:30:00   1500
3  2023-01-25 14:00:00   2500

### ANSWER TO QUESTION 13:

#### To use the basic functions of pandas, what is the first and foremost necessary library that needs to be imported?

#### importing pandas libnrary is the first and foremost thing that we mustfirst and we may use alice to call it whereever we need it.